### [DataFrame 연산 - 2 ]
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- DataFrame과 DataFrame 연산 수행

In [35]:
import pandas as pd

In [36]:
# [2] 데이터 준비
data={'A':[98,78,156,99],
      'B':[78,56,85,45]}

In [37]:
# [3] Dict => DF
DF1=pd.DataFrame(data)
DF2=DF1/4

In [38]:
print(DF1,DF2,sep='\n\n')

     A   B
0   98  78
1   78  56
2  156  85
3   99  45

       A      B
0  24.50  19.50
1  19.50  14.00
2  39.00  21.25
3  24.75  11.25

In [39]:
# [4] 연산 수행
# - 산술 연산
DF1 - DF2

        A      B
0   73.50  58.50
1   58.50  42.00
2  117.00  63.75
3   74.25  33.75

In [40]:
# - 비교 연산
DF1 <= DF2

       A      B
0  False  False
1  False  False
2  False  False
3  False  False

In [41]:
# [5] 연산수행 => DF와 SR  => 전부 NAN 값 반환
# - 산술 연산
SR1=DF1['A']

In [42]:
DF2+SR1

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [45]:
# [SR과 DF의 연산 방법1] SR => DF로 변환 : sr객체.To_frame()
SRDF=SR1.to_frame()
DF1

     A   B
0   98  78
1   78  56
2  156  85
3   99  45

In [48]:
# [SR과 DF의 연산 방법 2] 
DF1.columns=[0,1]
DF1

     0   1
0   98  78
1   78  56
2  156  85
3   99  45

In [51]:
DF1.T+SR1

     0    1    2    3
0  196  156  312  198
1  176  134  241  144

In [52]:
SR1

0     98
1     78
2    156
3     99
Name: A, dtype: int64